{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.7/4.0"
      ],
      "degree": "Bachelor of Science with Honours",
      "department": "Electrical and Computer Engineering",
      "duration": "2019-2023",
      "school_name": "York University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_CalvinTan",
  "highlighted_projects": [
    {
      "description": "Scans all 65,535 ports of a given IP address and returns the open ports. Each port is scanned on a different thread to execute the heavily I/O bound process in parallel.",
      "name": "Port Scanner"
    },
    {
      "description": "Implements a Windows System Tray Tool that assists with the regulation of the current power plan of the PC. This application executes batch files to execute CMD commands to access power plan controls.",
      "name": "Windows Power Plan Tool"
    }
  ],
  "jarvis_projects": [
    {
      "description": "This project implements a few utilities designed to help the Jarvis Cluster Administration (LCA) team collect system specifications as well as resource usage from each node running on their Linux cluster. The LCA team would use this information for real-time resource monitoring as well as planning how to allocate these resources in the future. The specifications and usage statistics are collected using bash scripts and stored in a PostgreSQL database which runs in a Docker container. Usage statistics are gathered every minute and inserted into the database with timestamps.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Calvin Tan",
  "others": [
    {
      "bullets": [
        "Microsoft Azure AI Fundamentals"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Running",
        "Cooking",
        "Cooperative video games"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed a cluster management solution for the Linux Cluster Administration team utlizing bash scripts, Docker, and PostgreSQL. Designed, created, and maintained an efficient and robust database",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "York University",
      "description": "Organised and facilitaded two 90 minute study sessions to assit students with difficulties in PHYS1800 (Engineering Mechanics). Prior to each session, lectures would be attended to keep up with the specific material students were learning. Learning material would then be produced based on the lecture content to be tackled as a group during PASS sessions. Before midterms and finals, mock test and exams were hosted to help students feel more prepared.",
      "duration": "2020",
      "title": "PASS Leader"
    }
  ],
  "skills": {
    "competent": [
      "JavaScript",
      "REST API",
      "Linux/Bash",
      "Machine Learning",
      "Express.js"
    ],
    "familiar": [
      "SpringBoot",
      "React",
      "Machine Learning",
      "C#",
      "Unity"
    ],
    "proficient": [
      "Java",
      "Python",
      "NodeJS",
      "RDBMS/SQL",
      "Agile/Scrum"
    ]
  },
  "summary": "A recent graduate with a Specialized Honours BSc. Computer Science from York University. With a deep passion for software development, I am always looking to learn more and further improve my skills. I am a team player who can also get things done independently."
}
