{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.7/4.0"
      ],
      "degree": "Bachelor of Science with Honours",
      "department": "Electrical Engineering and Computer Science",
      "duration": "2019-2023",
      "school_name": "York University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_CalvinTan",
  "highlighted_projects": [
    {
      "description": "Built a tool in Java that is capable of scanning for open ports from a given IP address. Utilizing Java's multithreading feature, up to 10,000 ports in parallel for highly optimized performance. Implements a REST API using Spring Boot to allow the tool to be accessed from any web browser.",
      "name": "Port Scanner"
    },
    {
      "description": "Designed and implemented a system tray tool to allow users to easily swap between different power plans on a Windows device. The tool executes batch files to access the PC's power plan controls. A GUI built using Windows Forms allows users to see the current power plan at a glance and change it through the system tray icon.",
      "name": "Windows Power Plan Tool"
    }
  ],
  "jarvis_projects": [
    {
      "description": "This project implements a few utilities designed to help the Jarvis Cluster Administration (LCA) team collect system specifications as well as resource usage from each node running on their Linux cluster. The LCA team would use this information for real-time resource monitoring as well as planning how to allocate these resources in the future. The specifications and usage statistics are collected using bash scripts and stored in a PostgreSQL database which runs in a Docker container. Usage statistics are gathered every minute and inserted into the database with timestamps.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: Developed a Java app that mirrors the functionality provided by the grep command commonly found on Linux systems. Given a regex expression, the program recursively scans for files in a given directory and looks for matches in each file. By implementing the app using Streams, storing redundant data during intermediate operations is avoided resulting in highly optimized memory consumption. The app is also packaged with Maven and dockerized with Docker.",
        "Grep App: Designed and implemented a Java Stock Quote application that allows users to simulate stock trading with real-time stock information. The app runs and receives commands from the command line. Utilizes an OkHttp client to pull up-to-date stock quotes from the Alpha Vantage API. Allows users to buy and sell stocks based on these quotes and stores their holdings in a PostgreSQL database. Utilizes JDBC with a PostgreSQL Driver to handle reads and writes between the program and the database. Implements DAO and Repository design patterns to enable highly maintainable code."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Analyzed an online retailer's sales to data generate reports on user growth, revenue, etc. Identified different segments to target by creating and assigning RFM (Recency, Frequency, Monetary) values to each customer. Looked for ways to boost company growth by analyzing the generated reports. Tools used include python, Jupyter notebook, PostgreSQL, Docker.",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "Developed a front-end web application using Angular. Allows user to view the trading profiles of multiple traders in a list. New users can be added and existing traders can have their information updated. Trader data and stock quote data are pulled from a mock server running on NodeJS using a HttpClient. The program is containerized using Docker.",
      "git_url": "/angular-frontend",
      "name": "Angular Trading App"
    }
  ],
  "name": "Calvin Tan",
  "others": [
    {
      "bullets": [
        "Have the Microsoft Azure AI Fundamentals certificate"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Running: Recently started getting into running around May 2024. Currently able to run 5k in about 32 minutes, aiming to run 10k in under an hour by the end of 2024",
        "Cooking: Capable of cooking a wide variety of tasty dishes including kimchi rice, lasagna, takoyaki, spaghetti carbonara and many more",
        "Video Games: A big fan of all genres of games with a preference for rpgs and coop games. Used to play League of Legends, Lost Ark. Currently playing Deep Rock Galactic, Divinity 2, Risk of Rain 2"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked under the Scrum framework to deliver quality solutions in an efficient matter. Participated in sprint planning, stand-ups, retrospects to effectively communicate project progress and goals. Worked with technologies including Java, PostgreSQL, and Docker in a Linux environment to build backend software products. Utilized Maven to cleanly manage Java project dependencies and builds. Used Docker to run PostgreSQL databases in a container as well as dockerize completed Java projects.",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "York University",
      "description": "Organized and facilitated two 90 minute study sessions weekly to assist students with difficulties in PHYS1800 (Engineering Mechanics). Prior to each session, lectures would be attended to keep up with the specific material students were learning. Learning material would then be produced based on the lecture content to be tackled as a group during PASS sessions. Before midterms and finals, mock tests and exams were hosted to help students feel more prepared.",
      "duration": "2020",
      "title": "PASS Leader"
    }
  ],
  "skills": {
    "competent": [
      "JavaScript",
      "Typescript",
      "React",
      "Docker",
      "Socket.IO",
      "Maven",
      "Linux/Bash",
      "Pandas",
      "Jupyter Notebook",
      "Express.js"
    ],
    "familiar": [
      "SpringBoot",
      "React",
      "Scikit-learn",
      "C#",
      "Unity"
    ],
    "proficient": [
      "Java",
      "Python",
      "NodeJS",
      "Angular",
      "RDBMS/SQL",
      "Agile/Scrum"
    ]
  },
  "summary": "With an Honours degree in Computer Science from York University, I am equipped with a wide array of skills allowing me to excel in backend software development. Throughout my academic journey, I have worked on projects including a Java e-commerce program and machine learning on a Yelp dataset to gain crucial insights, developing my skills in Java, Python, and communication along the way. Through personal projects, I gained a deeper understanding of concepts and technologies such as multithreading and PowerShell. Demonstrating my proficiency in backend development, some of my personal projects include a port scanning application and a Windows system tray app that allows for quick access to power plan settings. Other technologies that I am familiar with include NodeJS, Python, React, and Maven. I am currently working at Jarvis where I am utilizing technologies including Docker, Java, SQL, and many more on a wide array of projects. My current position has also provided me with experience working under the Scrum/Agile framework. I believe my skill set allows me to excel in any development environment."
}
